# Pandas

- Pandas is an open-source library that is made mainly for working with relational or labeled data both easily and intuitively. 
- It provides various data structures and operations for manipulating numerical data and time series. 
- This library is built on top of the NumPy library. 
- Pandas is fast and it has high performance & productivity for users.
- Pandas generally provide two data structures for manipulating data, They are: 
   - Series
   - DataFrame

In [79]:
#Importing necessary libraries

In [2]:
import pandas as pd

In [101]:
import warnings
warnings.filterwarnings('ignore')

# Series
- Series is a one-dimensional labeled array and capable of holding data of any type (integer, string, float, python objects, etc.)

In [80]:
#Series creation.

In [103]:
lst = [10,10.5,'Python']
type(lst)

list

In [105]:
s = pd.Series(lst)

In [106]:
s

0        10
1      10.5
2    Python
dtype: object

In [107]:
type(s)

pandas.core.series.Series

In [109]:
s1 = pd.Series(data = ['Python','Machine learning','DL'], index=['S1','S2','S3'], name='My series')
s1

S1              Python
S2    Machine learning
S3                  DL
Name: My series, dtype: object

In [111]:
d = {1:'Python',2:'ML',3:"DL"}
type(d)

dict

In [112]:
s2 = pd.Series(d)

In [113]:
print(s2)
print(type(s2))

1    Python
2        ML
3        DL
dtype: object
<class 'pandas.core.series.Series'>

In [81]:
#Accessing elements from a series using index labels.

In [115]:
s1['S1']

'Python'

In [116]:
s1['S3']

'DL'

In [27]:
#Series slicing

In [121]:
s1

S1              Python
S2    Machine learning
S3                  DL
Name: My series, dtype: object

In [123]:
s1[1:3]

S2    Machine learning
S3                  DL
Name: My series, dtype: object

# DataFrame
- A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns

**Ways to create pandas DataFrame.**
1. By creating a nested lists and colname lists.
2. By creating a dictionary

In [157]:
lst = [['Python',100,'Pune'],['ML',90,'Mumbai'],['DL',96,'HYD']]
col = ['Subject','Marks','City']

In [159]:
df1 = pd.DataFrame(data = lst,columns=col )
df1

  Subject  Marks    City
0  Python    100    Pune
1      ML     90  Mumbai
2      DL     96     HYD

In [146]:
df = pd.DataFrame({
    'Rank' : [1,2,3],
    'Python' : [100,90,85],
    'Machine learning' : [100,98,96]
    
})
df

   Rank  Python  Machine learning
0     1     100               100
1     2      90                98
2     3      85                96

In [37]:
#Check number of rows and columns in dataframe

In [135]:
df.shape

(3, 3)

In [38]:
#Dimesion of the dataframe

In [132]:
df.ndim

2

In [40]:
#Data type of each column

In [137]:
df.dtypes

Rank                int64
Python              int64
Machine learning    int64
dtype: object

In [141]:
df

  Subject  Marks    City
0  Python    100    Pune
1      ML     90  Mumbai
2      DL     96     HYD

In [140]:
df.dtypes

Subject    object
Marks       int64
City       object
dtype: object

In [142]:
df['Subject'].dtype

dtype('O')

In [144]:
df.Subject

0    Python
1        ML
2        DL
Name: Subject, dtype: object

In [145]:
df['Subject']

0    Python
1        ML
2        DL
Name: Subject, dtype: object

In [147]:
df

   Rank  Python  Machine learning
0     1     100               100
1     2      90                98
2     3      85                96

In [148]:
df.Machine learning

SyntaxError: invalid syntax (2320959638.py, line 1)

In [152]:
df[['Machine learning']]

   Machine learning
0               100
1                98
2                96

In [153]:
df[['Rank','Python']]

   Rank  Python
0     1     100
1     2      90
2     3      85

In [154]:
df[['Rank','Machine learning']]

   Rank  Machine learning
0     1               100
1     2                98
2     3                96

In [42]:
#Descriptive stats for df

In [156]:
df.describe()

       Rank      Python  Machine learning
count   3.0    3.000000               3.0
mean    2.0   91.666667              98.0
std     1.0    7.637626               2.0
min     1.0   85.000000              96.0
25%     1.5   87.500000              97.0
50%     2.0   90.000000              98.0
75%     2.5   95.000000              99.0
max     3.0  100.000000             100.0

In [160]:
df1

  Subject  Marks    City
0  Python    100    Pune
1      ML     90  Mumbai
2      DL     96     HYD

In [165]:
df1.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Subject,3,3,Python,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marks,3.0,NaN,NaN,NaN,95.333333,5.033223,90.0,93.0,96.0,98.0,100.0
City,3,3,Pune,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [43]:
#Getting information about the dataframe.

In [166]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Rank              3 non-null      int64
 1   Python            3 non-null      int64
 2   Machine learning  3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [82]:
#Checking null values

In [168]:
df.isnull().sum()

Rank                0
Python              0
Machine learning    0
dtype: int64

# Importing External Dataset

In [1]:
#Load the csv file
import pandas as pd

In [2]:
df = pd.read_csv("Salaries.csv")
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [3]:
#Reading first 5 records

In [4]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [5]:
#Reading last 5 records

In [6]:
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [7]:
#Reading all the records.

In [8]:
pd.set_option('display.max_rows',None)

In [9]:
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
5        Prof          A   20       20    Male  122400
6   AssocProf          A   20       17    Male   81285
7        Prof          A   18       18    Male  126300
8        Prof          A   29       19    Male   94350
9        Prof          A   51       51    Male   57800
10       Prof          B   39       33    Male  128250
11       Prof          B   23       23    Male  134778
12   AsstProf          B    1        0    Male   88000
13       Prof          B   35       33    Male  162200
14       Prof          B   25       19    Male  153750
15       Prof          B   17        3    Male  150480
16   AsstProf          B    8        3    Male   75044
17   AsstProf          B    4        0    Male   92000
18       Prof          A   19        7    Male  107300
19       Prof          A   29       27    Male  150500
20   AsstProf          B    4        4    Male   92000
21       Prof          A   33       30    Male  103106
22   AsstProf          A    4        2    Male   73000
23   AsstProf          A    2        0    Male   85000
24       Prof          A   30       23    Male   91100
25       Prof          B   35       31    Male   99418
26       Prof          A   38       19    Male  148750
27       Prof          A   45       43    Male  155865
28   AsstProf          B    7        2    Male   91300
29       Prof          B   21       20    Male  123683
30  AssocProf          B    9        7    Male  107008
31       Prof          B   22       21    Male  155750
32       Prof          A   27       19    Male  103275
33       Prof          B   18       18    Male  120000
34  AssocProf          B   12        8    Male  119800
35       Prof          B   28       23    Male  126933
36       Prof          B   45       45    Male  146856
37       Prof          A   20        8    Male  102000
38   AsstProf          B    4        3    Male   91000
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [10]:
df.head(2)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [11]:
#Describe the data

In [12]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [13]:
df.describe(include='O')

        rank discipline   sex
count     78         78    78
unique     3          2     2
top     Prof          B  Male
freq      46         42    39

In [14]:
#Extracting only column names

In [15]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [16]:
#Selecting single and multiple columns

In [17]:
df['rank']

0          Prof
1          Prof
2          Prof
3          Prof
4          Prof
5          Prof
6     AssocProf
7          Prof
8          Prof
9          Prof
10         Prof
11         Prof
12     AsstProf
13         Prof
14         Prof
15         Prof
16     AsstProf
17     AsstProf
18         Prof
19         Prof
20     AsstProf
21         Prof
22     AsstProf
23     AsstProf
24         Prof
25         Prof
26         Prof
27         Prof
28     AsstProf
29         Prof
30    AssocProf
31         Prof
32         Prof
33         Prof
34    AssocProf
35         Prof
36         Prof
37         Prof
38     AsstProf
39         Prof
40         Prof
41    AssocProf
42     AsstProf
43     AsstProf
44         Prof
45         Prof
46     AsstProf
47    AssocProf
48         Prof
49         Prof
50     AsstProf
51         Prof
52         Prof
53     AsstProf
54    AssocProf
55     AsstProf
56    AssocProf
57     AsstProf
58         Prof
59    AssocProf
60     AsstProf
61    AssocProf
62    AssocProf
63         Prof
64    AssocProf
65         Prof
66     AsstProf
67         Prof
68     AsstProf
69         Prof
70     AsstProf
71    AssocProf
72         Prof
73         Prof
74    AssocProf
75         Prof
76         Prof
77         Prof
Name: rank, dtype: object

In [18]:
df[['rank','salary']]

         rank  salary
0        Prof  186960
1        Prof   93000
2        Prof  110515
3        Prof  131205
4        Prof  104800
5        Prof  122400
6   AssocProf   81285
7        Prof  126300
8        Prof   94350
9        Prof   57800
10       Prof  128250
11       Prof  134778
12   AsstProf   88000
13       Prof  162200
14       Prof  153750
15       Prof  150480
16   AsstProf   75044
17   AsstProf   92000
18       Prof  107300
19       Prof  150500
20   AsstProf   92000
21       Prof  103106
22   AsstProf   73000
23   AsstProf   85000
24       Prof   91100
25       Prof   99418
26       Prof  148750
27       Prof  155865
28   AsstProf   91300
29       Prof  123683
30  AssocProf  107008
31       Prof  155750
32       Prof  103275
33       Prof  120000
34  AssocProf  119800
35       Prof  126933
36       Prof  146856
37       Prof  102000
38   AsstProf   91000
39       Prof  129000
40       Prof  137000
41  AssocProf   74830
42   AsstProf   80225
43   AsstProf   77000
44       Prof  151768
45       Prof  140096
46   AsstProf   74692
47  AssocProf  103613
48       Prof  111512
49       Prof  122960
50   AsstProf   97032
51       Prof  127512
52       Prof  105000
53   AsstProf   73500
54  AssocProf   62884
55   AsstProf   72500
56  AssocProf   77500
57   AsstProf   72500
58       Prof  144651
59  AssocProf  103994
60   AsstProf   92000
61  AssocProf  103750
62  AssocProf  109650
63       Prof   91000
64  AssocProf   73300
65       Prof  117555
66   AsstProf   63100
67       Prof   90450
68   AsstProf   77500
69       Prof  116450
70   AsstProf   78500
71  AssocProf   71065
72       Prof  161101
73       Prof  105450
74  AssocProf  104542
75       Prof  124312
76       Prof  109954
77       Prof  109646

In [29]:
df.head(2)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [19]:
#Selecting columns with loc and iloc

In [20]:
df.loc[ : ,'service']

0     49
1      6
2     20
3     31
4     18
5     20
6     17
7     18
8     19
9     51
10    33
11    23
12     0
13    33
14    19
15     3
16     3
17     0
18     7
19    27
20     4
21    30
22     2
23     0
24    23
25    31
26    19
27    43
28     2
29    20
30     7
31    21
32    19
33    18
34     8
35    23
36    45
37     8
38     3
39    18
40    36
41     8
42     2
43     0
44    19
45    25
46     3
47    11
48    17
49    18
50     5
51    14
52     0
53     3
54    22
55     0
56     8
57     1
58    26
59    10
60     3
61    10
62     7
63    27
64    24
65    19
66     6
67    11
68     2
69     7
70     3
71     9
72    15
73    10
74     6
75    17
76    14
77    15
Name: service, dtype: int64

In [21]:
df.head(2)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [30]:
df.loc[:,'discipline':'service']#loc includes last index

   discipline  phd  service
0           B   56       49
1           A   12        6
2           A   23       20
3           A   40       31
4           B   20       18
5           A   20       20
6           A   20       17
7           A   18       18
8           A   29       19
9           A   51       51
10          B   39       33
11          B   23       23
12          B    1        0
13          B   35       33
14          B   25       19
15          B   17        3
16          B    8        3
17          B    4        0
18          A   19        7
19          A   29       27
20          B    4        4
21          A   33       30
22          A    4        2
23          A    2        0
24          A   30       23
25          B   35       31
26          A   38       19
27          A   45       43
28          B    7        2
29          B   21       20
30          B    9        7
31          B   22       21
32          A   27       19
33          B   18       18
34          B   12        8
35          B   28       23
36          B   45       45
37          A   20        8
38          B    4        3
39          B   18       18
40          A   39       36
41          A   13        8
42          B    4        2
43          B    5        0
44          B   23       19
45          B   25       25
46          B   11        3
47          B   11       11
48          B   17       17
49          B   17       18
50          B   10        5
51          B   20       14
52          A   12        0
53          A    5        3
54          A   25       22
55          A    2        0
56          A   10        8
57          A    3        1
58          B   36       26
59          B   12       10
60          B    3        3
61          B   13       10
62          B   14        7
63          A   29       27
64          A   26       24
65          A   36       19
66          A    7        6
67          A   17       11
68          A    4        2
69          A   28        7
70          A    8        3
71          B   12        9
72          B   24       15
73          B   18       10
74          B   19        6
75          B   17       17
76          A   28       14
77          A   23       15

In [28]:
df.head(2)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [27]:
#Extract values from 5th to 45 from phd, service , sex and salary column

In [31]:
df.loc[5:45,'phd':'salary']

    phd  service     sex  salary
5    20       20    Male  122400
6    20       17    Male   81285
7    18       18    Male  126300
8    29       19    Male   94350
9    51       51    Male   57800
10   39       33    Male  128250
11   23       23    Male  134778
12    1        0    Male   88000
13   35       33    Male  162200
14   25       19    Male  153750
15   17        3    Male  150480
16    8        3    Male   75044
17    4        0    Male   92000
18   19        7    Male  107300
19   29       27    Male  150500
20    4        4    Male   92000
21   33       30    Male  103106
22    4        2    Male   73000
23    2        0    Male   85000
24   30       23    Male   91100
25   35       31    Male   99418
26   38       19    Male  148750
27   45       43    Male  155865
28    7        2    Male   91300
29   21       20    Male  123683
30    9        7    Male  107008
31   22       21    Male  155750
32   27       19    Male  103275
33   18       18    Male  120000
34   12        8    Male  119800
35   28       23    Male  126933
36   45       45    Male  146856
37   20        8    Male  102000
38    4        3    Male   91000
39   18       18  Female  129000
40   39       36  Female  137000
41   13        8  Female   74830
42    4        2  Female   80225
43    5        0  Female   77000
44   23       19  Female  151768
45   25       25  Female  140096

In [32]:
df.iloc[5:46, 2:]

    phd  service     sex  salary
5    20       20    Male  122400
6    20       17    Male   81285
7    18       18    Male  126300
8    29       19    Male   94350
9    51       51    Male   57800
10   39       33    Male  128250
11   23       23    Male  134778
12    1        0    Male   88000
13   35       33    Male  162200
14   25       19    Male  153750
15   17        3    Male  150480
16    8        3    Male   75044
17    4        0    Male   92000
18   19        7    Male  107300
19   29       27    Male  150500
20    4        4    Male   92000
21   33       30    Male  103106
22    4        2    Male   73000
23    2        0    Male   85000
24   30       23    Male   91100
25   35       31    Male   99418
26   38       19    Male  148750
27   45       43    Male  155865
28    7        2    Male   91300
29   21       20    Male  123683
30    9        7    Male  107008
31   22       21    Male  155750
32   27       19    Male  103275
33   18       18    Male  120000
34   12        8    Male  119800
35   28       23    Male  126933
36   45       45    Male  146856
37   20        8    Male  102000
38    4        3    Male   91000
39   18       18  Female  129000
40   39       36  Female  137000
41   13        8  Female   74830
42    4        2  Female   80225
43    5        0  Female   77000
44   23       19  Female  151768
45   25       25  Female  140096

In [26]:
df.iloc[:,1:4]

   discipline  phd  service
0           B   56       49
1           A   12        6
2           A   23       20
3           A   40       31
4           B   20       18
5           A   20       20
6           A   20       17
7           A   18       18
8           A   29       19
9           A   51       51
10          B   39       33
11          B   23       23
12          B    1        0
13          B   35       33
14          B   25       19
15          B   17        3
16          B    8        3
17          B    4        0
18          A   19        7
19          A   29       27
20          B    4        4
21          A   33       30
22          A    4        2
23          A    2        0
24          A   30       23
25          B   35       31
26          A   38       19
27          A   45       43
28          B    7        2
29          B   21       20
30          B    9        7
31          B   22       21
32          A   27       19
33          B   18       18
34          B   12        8
35          B   28       23
36          B   45       45
37          A   20        8
38          B    4        3
39          B   18       18
40          A   39       36
41          A   13        8
42          B    4        2
43          B    5        0
44          B   23       19
45          B   25       25
46          B   11        3
47          B   11       11
48          B   17       17
49          B   17       18
50          B   10        5
51          B   20       14
52          A   12        0
53          A    5        3
54          A   25       22
55          A    2        0
56          A   10        8
57          A    3        1
58          B   36       26
59          B   12       10
60          B    3        3
61          B   13       10
62          B   14        7
63          A   29       27
64          A   26       24
65          A   36       19
66          A    7        6
67          A   17       11
68          A    4        2
69          A   28        7
70          A    8        3
71          B   12        9
72          B   24       15
73          B   18       10
74          B   19        6
75          B   17       17
76          A   28       14
77          A   23       15

In [34]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [48]:
#Value counts

In [35]:
df['rank'].value_counts()

Prof         46
AsstProf     19
AssocProf    13
Name: rank, dtype: int64

In [36]:
df['salary'].nunique()

73

In [38]:
df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [39]:
df['rank'].nunique()

3

In [6]:
#Renaming column names

In [40]:
df.rename(columns={'rank':'RANK',})

         RANK discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
5        Prof          A   20       20    Male  122400
6   AssocProf          A   20       17    Male   81285
7        Prof          A   18       18    Male  126300
8        Prof          A   29       19    Male   94350
9        Prof          A   51       51    Male   57800
10       Prof          B   39       33    Male  128250
11       Prof          B   23       23    Male  134778
12   AsstProf          B    1        0    Male   88000
13       Prof          B   35       33    Male  162200
14       Prof          B   25       19    Male  153750
15       Prof          B   17        3    Male  150480
16   AsstProf          B    8        3    Male   75044
17   AsstProf          B    4        0    Male   92000
18       Prof          A   19        7    Male  107300
19       Prof          A   29       27    Male  150500
20   AsstProf          B    4        4    Male   92000
21       Prof          A   33       30    Male  103106
22   AsstProf          A    4        2    Male   73000
23   AsstProf          A    2        0    Male   85000
24       Prof          A   30       23    Male   91100
25       Prof          B   35       31    Male   99418
26       Prof          A   38       19    Male  148750
27       Prof          A   45       43    Male  155865
28   AsstProf          B    7        2    Male   91300
29       Prof          B   21       20    Male  123683
30  AssocProf          B    9        7    Male  107008
31       Prof          B   22       21    Male  155750
32       Prof          A   27       19    Male  103275
33       Prof          B   18       18    Male  120000
34  AssocProf          B   12        8    Male  119800
35       Prof          B   28       23    Male  126933
36       Prof          B   45       45    Male  146856
37       Prof          A   20        8    Male  102000
38   AsstProf          B    4        3    Male   91000
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [41]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [42]:
df.rename(columns={'discipline':'DISCIPLINE','phd': 'PHD'})

         rank DISCIPLINE  PHD  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
5        Prof          A   20       20    Male  122400
6   AssocProf          A   20       17    Male   81285
7        Prof          A   18       18    Male  126300
8        Prof          A   29       19    Male   94350
9        Prof          A   51       51    Male   57800
10       Prof          B   39       33    Male  128250
11       Prof          B   23       23    Male  134778
12   AsstProf          B    1        0    Male   88000
13       Prof          B   35       33    Male  162200
14       Prof          B   25       19    Male  153750
15       Prof          B   17        3    Male  150480
16   AsstProf          B    8        3    Male   75044
17   AsstProf          B    4        0    Male   92000
18       Prof          A   19        7    Male  107300
19       Prof          A   29       27    Male  150500
20   AsstProf          B    4        4    Male   92000
21       Prof          A   33       30    Male  103106
22   AsstProf          A    4        2    Male   73000
23   AsstProf          A    2        0    Male   85000
24       Prof          A   30       23    Male   91100
25       Prof          B   35       31    Male   99418
26       Prof          A   38       19    Male  148750
27       Prof          A   45       43    Male  155865
28   AsstProf          B    7        2    Male   91300
29       Prof          B   21       20    Male  123683
30  AssocProf          B    9        7    Male  107008
31       Prof          B   22       21    Male  155750
32       Prof          A   27       19    Male  103275
33       Prof          B   18       18    Male  120000
34  AssocProf          B   12        8    Male  119800
35       Prof          B   28       23    Male  126933
36       Prof          B   45       45    Male  146856
37       Prof          A   20        8    Male  102000
38   AsstProf          B    4        3    Male   91000
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

# Filtering data
- Filtering is widely used while working with the huge amount of data.
- Filtering allows us to extract specific data from the huge dataset for analysis.
- A common operation in data analysis is to filter values based on a condition or multiple conditions.

In [43]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [44]:
df['sex'].value_counts()

Male      39
Female    39
Name: sex, dtype: int64

In [55]:
df[df['salary']>150000]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
27  Prof          A   45       43    Male  155865
31  Prof          B   22       21    Male  155750
44  Prof          B   23       19  Female  151768
72  Prof          B   24       15  Female  161101

In [56]:
#Gender is female and salary is greater than 150000

In [59]:
df[(df['sex']=='Female') & (df['salary']>150000)]

    rank discipline  phd  service     sex  salary
44  Prof          B   23       19  Female  151768
72  Prof          B   24       15  Female  161101

In [62]:
df['phd'].mean()

19.705128205128204

In [83]:
#What is the average salary of females?

In [64]:
df[df['sex']=='Female']['salary'].mean()

avg_salary_f = df[df['sex']=='Female']['salary'].mean()

print('The average salary of females is: ',avg_salary_f )

The average salary of females is:  101002.41025641025

In [84]:
#What is the average salary of rank prof?

In [65]:
df[df['rank'] == 'Prof']['salary'].mean()

123624.80434782608

In [85]:
#What is the average salary of rank prof and discipline is A?

In [67]:
df[(df['rank']=='Prof') & (df['discipline'] == 'A')]['salary'].mean()

111935.69565217392

In [72]:
#What is the average salary of rank prof?

In [71]:
df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [72]:
df[df['rank']=='AssocProf']['salary'].mean()

91786.23076923077

In [75]:
#What is the average salary of rank Associate Prof?

In [76]:
#What is the average salary of rank Assistant Prof?

In [74]:
df[df['rank']=='AsstProf']['salary'].mean()

81362.78947368421

**Groupby function**
- Instead of calculating average salaries separately, we can use pandas groupby method.

In [77]:
df.groupby('rank')['salary'].mean()

rank
AssocProf     91786.230769
AsstProf      81362.789474
Prof         123624.804348
Name: salary, dtype: float64

In [78]:
#Grouby aggregate method

In [78]:
#min,max,mean,median

In [81]:
df.groupby('rank')['salary'].agg({'min','max','mean','median'})

              max    median    min           mean
rank
AssocProf  119800  103613.0  62884   91786.230769
AsstProf    97032   78500.0  63100   81362.789474
Prof       186960  123321.5  57800  123624.804348